package model

import (
	"gorm.io/gorm"
	gorm2 "miniproject/app/core/gorm"
	"miniproject/app/service/signup"
)

// 初始的大陆
var Mainlands [5]Mainland

// 大陆照片
var Mainlandmages [5]string

// 每个州不同状态的照片
var Stateimages [15]string

// 动物照片
var Animalsimages [25]string

// 环保建筑物的照片
var Goodbuildingimages [4]string

// 污染建筑物的照片
var Badbuildingimages [4]string

// 植物的图片
var Plantimages [15]string

// 注册和登陆时用于读取用户信息的结构体
var Usersign Usersl

// 用于查询资料时的用户
var User1 User

// 用于查询资料的planetname
var Planetname string

// 用户发过来的验证码
var Codehttp string

// 用户的email
var Email string

// 用户的密码
var Password string

// redis的客户端
var Client = signup.Buildclient()

// 用户真正的验证码
var Code string

// 大陆图片+不同阶段图片+好的建筑+坏建筑+动物+植物
var DB *gorm.DB = gorm2.Linktodatabase()

var Animals = [25]Animinal{
	{"长臂猿", 2, 1, "一种树栖性动物，以其特别长的双臂而得名", "url", 0, "", "西伦瑞亚", ""},
	{"枯叶蛱蝶", 1, 0.5, "翅正面呈黑褐色，具有深蓝色的光泽", "url", 0, "", "西伦瑞亚", ""},
	{"兰花螳螂", 1, 0.5, "一种颜色鲜艳、外形独特的昆虫，以其能够模仿兰花的外观而闻名", "url", 0, "", "西伦瑞亚", ""},
	{"红眼树蛙", 2, 1, "一种生活在中美洲热带雨林中的树栖蛙类，以其鲜艳的红色眼睛而闻名", "url", 0, "", "西伦瑞亚", ""},
	{"琉球银斑黑鸽", 0, 1, "外观上全身呈黑色，但根据光照的不同，有时会出现紫色或绿色的光泽", "url", 0, "", "西伦瑞亚", ""},
	{"金猫", 2, 1, "一种中等体型的猫科动物，头部两眼内各有一条白纹", "url", 0, "", "米尔勒拉", ""},
	{"岩羊", 1, 0.5, "体色与岩石相似，背部通常是棕灰色或石板灰色，并略带蓝色反光。", "url", 0, "", "米尔勒拉", ""},
	{"山地大猩猩", 2, 1, "一种体型庞大的灵长类动物", "url", 0, "", "米尔勒拉", ""},
	{"藏狐", 2, 1, "一种生活在高原地区的食肉动物，属于犬科狐属", "url", 0, "", "米尔勒拉", ""},
	{"盘羊", 0, 1, "是一种偶蹄目牛科的哺乳动物，属于国家二级保护动物", "url", 0, "", "米尔勒拉", ""},
	{"鬣狗", 2, 1, "一种食肉目鬣狗科动物，它们分布在非洲和亚洲南部", "url", 0, "", "乌兰宇蒂", ""},
	{"长颈鹿", 1, 0.5, "一种生活在非洲的大型动物，以其显著的长颈和高大的身躯而闻名", "url", 0, "", "乌兰宇蒂", ""},
	{"斑马", 1, 0.5, "具有醒目的黑白条纹，属于哺乳纲马科", "url", 0, "", "乌兰宇蒂", ""},
	{"蜜獾", 2, 1, "也被称为平头哥，是一种属于鼬科的动物，以其无畏的性格和对蜂蜜的喜爱而闻名", "url", 0, "", "乌兰宇蒂", ""},
	{"蓝马羚", 0, 1, "皮毛呈现出美丽的正蓝色，而死去后颜色会发生变化", "url", 0, "", "乌兰宇蒂", ""},
	{"耳廓狐", 2, 1, "是世界上最小的狐狸种类，属于犬科狐属", "url", 0, "", "碦拉玛干", ""},
	{"骆驼", 1, 0.5, "沙漠地区的象征生物", "url", 0, "", "碦拉玛干", ""},
	{"响尾蛇", 1, 0.5, "以其尾部的响板而闻名，这些响板在蛇受到威胁时会发出警告性的响声", "url", 0, "", "碦拉玛干", ""},
	{"科莫多巨蜥", 2, 1, "科莫多巨蜥是世界上最大的现存蜥蜴，也是印度尼西亚的特有物种", "url", 0, "", "碦拉玛干", ""},
	{"魔鳉", 0, 1, "外表看起来普通，但它是世界上最稀有的鱼类之一", "url", 0, "", "碦拉玛干", ""},
	{"帝企鹅", 2, 1, "生活在南极的大型企鹅", "url", 0, "", "云格雷诺", ""},
	{"南极磷虾", 1, 0.5, "一种生活在南极海域的小型甲壳类动物，", "url", 0, "", "云格雷诺", ""},
	{"南极羽毛星", 1, 0.5, "一种在南极洲周围海域发现的新物种，属于无脊椎海洋动物", "url", 0, "", "云格雷诺", ""},
	{"蓝鲸", 2, 1, "目前地球上已知体积最大的动物，属于须鲸科须鲸属", "url", 0, "", "云格雷诺", ""},
	{"北极狼", 0, 1, "也被称为白狼，是灰狼的一个亚种", "url", 0, "", "云格雷诺", ""},
}

var Plants = [12]Plant{
	{"望天树", 1, 0.5, "一种属于龙脑香科柳安属的植物，也是亚洲热带雨林的特征代表性树种", "url", "西伦瑞亚", 0, "在之后赋值", ""},
	{"巨魔芋", 2, 1, "原产于印度尼西亚苏门答腊西部的植物，因其花朵形体巨大而得名", "url", "西伦瑞亚", 0, "在之后赋值", ""},
	{"大王花", 1, 0.5, "一种肉质寄生草本植物，属于大花草科大王花属", "url", "西伦瑞亚", 0, "在之后赋值", ""},
	{"红景天", 1, 0.5, "具有多种药用价值", "url", "米尔勒拉", 0, "在之后赋值", ""},
	{"塔黄", 2, 1, "生长在高海拔地区的草本植物，属于蓼科大黄属", "url", "米尔勒拉", 0, "在之后赋值", ""},
	{"雪兔子", 1, 0.5, "一种多年生草本植物，属于菊科风毛菊属", "url", "米尔勒拉", 0, "在之后赋值", ""},
	{"金合欢", 1, 0.5, "具有抗菌消炎、消肿止痛的功效", "url", "乌兰宇蒂", 0, "在之后赋值", ""},
	{"香肠树", 1, 0.5, "紫葳科吊灯树属的一种大乔木植物，因其果实外形酷似香肠而得名", "url", "乌兰宇蒂", 0, "在之后赋值", ""},
	{"猴面包树", 1, 0.5, "生长在非洲热带草原上的植物，以其独特的外形和强大的生命力而闻名", "url", "乌兰宇蒂", 0, "在之后赋值", ""},
	{"风滚草", 2, 1, "一种具有独特生存策略的植物，以其能够在恶劣环境中生存和传播而闻名", "url", "碦拉玛干", 0, "在之后赋值", ""},
	{"沙棘", 1, 0.5, "嫩枝、叶、花和果均被生有白色鳞片", "url", "碦拉玛干", 0, "在之后赋值", ""},
	{"百岁兰", 1, 0.5, "树杆非常短矮粗壮，呈倒圆锥状,叶子像海带", "url", "碦拉玛干", 0, "在之后赋值", ""},
	/*{"批碱草", 1, "生长在极地地区的草本植物", "url", "云格雷诺", 0, "在之后赋值", ""},
	{"极地牛蹄草", 1, "生长矮小的柳科植物", "url", "云格雷诺", 0, "在之后赋值", ""},
	{"北极茶", 1, "生长力十分强大的苔藓植物", "url", "云格雷诺", 0, "在之后赋值", ""},*/
}

var Goodbuildings = [20]Goodbuilding{
	{"太阳能建筑", 1, "url", 1, "能源来源易得，安全可靠", 0, 0.5, "", "", "西伦瑞亚"},
	{"风力发电站", 2, "url", 1, "能源清洁可再生", 0, 1, "", "", "西伦瑞亚"},
	{"水力发电站", 3, "url", 1, "是一种清洁、可再生能源的发电方式，对环境影响较小，且能够稳定地提供持续的电力。", 0, 3, "", "", "西伦瑞亚"},
	{"人工湿地", 4, "url", 1, "一种人为构建的生态系统，旨在模拟自然湿地的功能", 0, 4, "", "", "西伦瑞亚"},
	{"太阳能建筑", 1, "url", 1, "能源来源易得，安全可靠", 0, 1, "", "", "米尔勒拉"},
	{"风力发电站", 2, "url", 1, "能源清洁可再生", 0, 3, "", "", "米尔勒拉"},
	{"水力发电站", 3, "url", 1, "是一种清洁、可再生能源的发电方式，对环境影响较小，且能够稳定地提供持续的电力。", 0, 4.5, "", "", "米尔勒拉"},
	{"人工湿地", 4, "url", 1, "一种人为构建的生态系统，旨在模拟自然湿地的功能", 0, 4, "", "", "米尔勒拉"},
	{"太阳能建筑", 1, "url", 1, "能源来源易得，安全可靠", 0, 1, "", "", "乌兰宇蒂"},
	{"风力发电站", 2, "url", 1, "能源清洁可再生", 0, 2, "", "", "乌兰宇蒂"},
	{"水力发电站", 3, "url", 1, "是一种清洁、可再生能源的发电方式，对环境影响较小，且能够稳定地提供持续的电力。", 0, 1.5, "", "", "乌兰宇蒂"},
	{"人工湿地", 4, "url", 1, "一种人为构建的生态系统，旨在模拟自然湿地的功能", 0, 6, "", "", "乌兰宇蒂"},
	{"太阳能建筑", 1, "url", 1, "能源来源易得，安全可靠", 0, 1.5, "", "", "碦拉玛干"},
	{"风力发电站", 2, "url", 1, "能源清洁可再生", 0, 2, "", "", "碦拉玛干"},
	{"水力发电站", 3, "url", 1, "是一种清洁、可再生能源的发电方式，对环境影响较小，且能够稳定地提供持续的电力。", 0, 0, "", "", "碦拉玛干"},
	{"人工湿地", 4, "url", 1, "一种人为构建的生态系统，旨在模拟自然湿地的功能", 0, 0, "", "", "碦拉玛干"},
	{"太阳能建筑", 1, "url", 1, "能源来源易得，安全可靠", 0, 1, "", "", "云格雷诺"},
	{"风力发电站", 2, "url", 1, "能源清洁可再生", 0, 2, "", "", "云格雷诺"},
	{"水力发电站", 3, "url", 1, "是一种清洁、可再生能源的发电方式，对环境影响较小，且能够稳定地提供持续的电力。", 0, 0, "", "", "云格雷诺"},
	{"人工湿地", 4, "url", 1, "一种人为构建的生态系统，旨在模拟自然湿地的功能", 0, 0, "", "", "云格雷诺"},
}

var Badbuildings = [20]Badbuilding{
	{"塑料垃圾", "url", "导致土壤侵蚀，水源污染", 3, 0.1, 0.1, "", "西伦瑞亚", ""},
	{"过度砍伐", "url", "破坏生态系统", 2, 0.2, 0.2, "", "西伦瑞亚", ""},
	{"工业污染", "url", "产生污染气体危害大气", 1, 0.3, 0.3, "", "西伦瑞亚", ""},
	{"光污染", "url", "能源浪费且影响人类健康", 0, 0.3, 0.3, "", "西伦瑞亚", ""},
	{"塑料垃圾", "url", "导致土壤侵蚀，水源污染", 5, 0.1, 0.1, "", "米尔勒拉", ""},
	{"过度砍伐", "url", "破坏生态系统", 0, 0.2, 0.2, "", "米尔勒拉", ""},
	{"工业污染", "url", "产生污染气体危害大气", 2, 0.3, 0.3, "", "米尔勒拉", ""},
	{"光污染", "url", "能源浪费且影响人类健康", 1, 0.3, 0.3, "", "米尔勒拉", ""},
	{"塑料垃圾", "url", "导致土壤侵蚀，水源污染", 2, 0.1, 0.1, "", "乌兰宇蒂", ""},
	{"过度砍伐", "url", "破坏生态系统", 0, 0.2, 0.2, "", "乌兰宇蒂", ""},
	{"工业污染", "url", "产生污染气体危害大气", 2, 0.3, 0.3, "", "乌兰宇蒂", ""},
	{"光污染", "url", "能源浪费且影响人类健康", 1, 0.3, 0.3, "", "乌兰宇蒂", ""},
	{"塑料垃圾", "url", "导致土壤侵蚀，水源污染", 1, 0.1, 0.1, "", "碦拉玛干", ""},
	{"过度砍伐", "url", "破坏生态系统", 0, 0.2, 0.2, "", "碦拉玛干", ""},
	{"工业污染", "url", "产生污染气体危害大气", 0, 0.3, 0.3, "", "碦拉玛干", ""},
	{"光污染", "url", "能源浪费且影响人类健康", 0, 0.3, 0.3, "", "碦拉玛干", ""},
	{"塑料垃圾", "url", "导致土壤侵蚀，水源污染", 3, 0.1, 0.1, "", "云格雷诺", ""},
	{"过度砍伐", "url", "破坏生态系统", 0, 0.2, 0.2, "", "云格雷诺", ""},
	{"工业污染", "url", "产生污染气体危害大气", 0, 0.3, 0.3, "", "云格雷诺", ""},
	{"光污染", "url", "能源浪费且影响人类健康", 0, 0.3, 0.3, "", "云格雷诺", ""},
}

// 每个动物的照片的地址
var Animaladdress = [25]string{
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\长臂猿4.png",
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\枯叶蛱蝶.png",
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\兰花螳螂.png",
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\红眼树蛙 (2).png",
	"C:\\Users\\L1523\\Desktop\\隐藏物种卡片\\琉球银斑黑鸽.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\金猫.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\岩羊.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\山地大猩猩.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\藏狐.png",
	"C:\\Users\\L1523\\Desktop\\隐藏物种卡片\\盘羊.png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\鬣狗.png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\长颈鹿.png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\斑马1 (2).png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\蜜獾.png",
	"C:\\Users\\L1523\\Desktop\\隐藏物种卡片\\蓝马羚.jpg",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\耳廓狐.png",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\骆驼.png",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\响尾蛇.png",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\科莫多巨蜥.png",
	"C:\\Users\\L1523\\Desktop\\隐藏物种卡片\\魔鳉.webp",
	"C:\\Users\\L1523\\Desktop\\云格物种卡片图\\帝企鹅.png",
	"C:\\Users\\L1523\\Desktop\\云格物种卡片图\\南极磷虾.png",
	"C:\\Users\\L1523\\Desktop\\云格物种卡片图\\南极磷虾.png",
	"C:\\Users\\L1523\\Desktop\\云格物种卡片图\\蓝鲸.png",
	"C:\\Users\\L1523\\Desktop\\隐藏物种卡片\\北极狼 (1).png",
}

// 每个植物的照片的地址
var Plantaddress = [25]string{
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\望天树.png",
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\巨魔芋.png",
	"C:\\Users\\L1523\\Desktop\\西伦物种卡片图\\大王花.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\红景天.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\塔黄.png",
	"C:\\Users\\L1523\\Desktop\\米尔物种卡片图\\雪兔子.png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\金合欢.png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\香肠树.png",
	"C:\\Users\\L1523\\Desktop\\乌兰物种卡片图\\猴面包树.png",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\风滚草.png",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\沙棘.png",
	"C:\\Users\\L1523\\Desktop\\碦拉物种卡片图\\百岁兰.png",
}

// 环保建筑物的照片地址
var Goodbuildingaddress = [4]string{
	"C:\\Users\\L1523\\Desktop\\真实图片\\太阳能建筑.jpg",
	"C:\\Users\\L1523\\Desktop\\真实图片\\风力发电机.jpg",
	"C:\\Users\\L1523\\Desktop\\真实图片\\水力发电站(1).jpg",
	"C:\\Users\\L1523\\Desktop\\真实图片\\人工湿地(1)(1).png",
}

// 污染建筑物的照片地址
var Badbuildingaddress = [4]string{
	"C:\\Users\\L1523\\Desktop\\污染真实图片\\塑料污染.jpeg",
	"C:\\Users\\L1523\\Desktop\\污染真实图片\\过度砍伐 (千库网）.jpg",
	"C:\\Users\\L1523\\Desktop\\污染真实图片\\工业污染（pixabay jwvein）.jpg",
	"C:\\Users\\L1523\\Desktop\\污染真实图片\\光污染（摄图网）.jpg",
}
